[
  {
    "idCocktail": 0,
    "favourite": 0,
    "categorie": "Cocktails au rhum",
    "nom": "Mojito",
    "presentation": "• Réalisez la recette \"Mojito\" directement dans le verre. • Placer les feuilles de menthe dans le verre, ajoutez le sucre et le jus de citrons. Piler consciencieusement afin d'exprimer l'essence de la menthe mais sans la broyer. Ajouter le rhum, remplir le verre à moitié de glaçons et compléter avec de l'eau gazeuse. Mélanger doucement et servir avec une paille. • Servir dans un verre de type \"tumbler\". • Décor: Décorer de feuilles de menthe fraîches et d'une tranche de citron. • Utilise de préférence du jus de citron vert frais (pressé). Bien que la recette originale ne contienne pas d'angostura, vous pouvez y ajouter quelques gouttes afin de le rendre un peu plus sec.",
    "ingredients": [
      {
        "nom": "Rhum blanc",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Rhum brun",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Vodka",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Tequila",
        "dosage": 4,
        "unite": "cl"
      }
    ],
    "dateDeCreation": "2015-11-20T18:25:43.511Z",
    "dateDeModification": "2015-11-20T18:25:43.511Z"
  },
  {
    "idCocktail": 1,
    "categorie": "Cocktails au rhum",
    "nom": "Piña Colada",
    "favourite": 1,
    "presentation": "• Réalisez la recette \"Piña Colada\" au mixer. • Dans un blender (mixer), versez les ingrédients avec 5 ou 6 glaçons et mixez le tout. C'est prêt ! Versez dans le verre et dégustez. Peut aussi se réaliser au shaker si c'est juste pour une personne. • Servir dans un verre de type \"verre à vin\". • Décor: Décorer avec un morceau d'ananas et une cerise confite. • Vous pouvez ajouter une touche d'onctuosité en ajoutant une cuillère à soupe de crème fraîche dans le mixer.",
    "ingredients": [
      {
        "nom": "Rhum blanc",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Rhum brun",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Vodka",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Tequila",
        "dosage": 4,
        "unite": "cl"
      }
    ],
    "dateDeCreation": "2015-12-20T18:25:43.511Z",
    "dateDeModification": "2015-12-20T18:25:43.511Z"
  },
  {
    "idCocktail": 2,
    "categorie": "Cocktails classiques",
    "nom": "Black Jack",
    "favourite": 1,
    "presentation": "• Réalisez la recette \"Black Jack\" au shaker . • Préparer un café bien sucré. Frapper au shaker tous les ingrédients avec des glaçons. Servir sur des glaçons. • Servir dans un verre de type \"old fashioned\". • Décor: Placer un zeste de citron dans le verre. • Le nom du cocktail vient du jeu de cartes de casino.",
    "ingredients": [
      {
        "nom": "Rhum blanc",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "Rhum brun",
        "dosage": 4,
        "unite": "cl"
      },
      {
        "nom": "CocaCola",
        "dosage": 4,
        "unite": "cl"
      }
    ],
    "dateDeCreation": "2015-12-25T18:25:43.511Z",
    "dateDeModification": "2015-12-25T18:25:43.511Z"
  }
]